import Md from "components/md";
import { Tab, Tabs } from "components/tabs";

export default function School() {
  return (
    <Tabs>
      <Tab title="2020">
        <Md>{`
1. Грамота за зайняте І місце в обласній Олімпіаді школярів з баскетболу 3х3 (стрітбол)
1. Грамота за І місце в районних змаганнях з "стрітболу" серед загальноосвітніх шкіл 2002-2004 р.н. і молодші (юнаки)
1. Грамота за І місце в районних змаганнях з "стрітболу" серед загальноосвітніх шкіл 2002-2004 р.н. і молодші (дівчата)
1. Грамота за ІІ місце в районних змаганнях з "стрітболу" серед загальноосвітніх шкіл 2005 р.н. і молодші (дівчата)
`}</Md>
      </Tab>
      <Tab title="2019">
        <Md>{`
1. Грамота за І місце у змаганнях з баскетболу серед дівчат загальноосвітніх шкіл району
1. Грамота за І місце у змаганнях з баскетболу серед юнаків загальноосвітніх шкіл району
1. Грамота за зайняте ІІ місце у районному турі фізкультурно-патріотичного фестивалю школярів "Козацький гарт"
`}</Md>
      </Tab>
      <Tab title="2018">
        <Md>{`
1. Диплом за І місце у фінальних змаганнях Гімназіади України 2018 року з легкої атлетики серед дівчат у програмі естафетного бігу з результатом 2.21.7
1. Диплом за І місце у фінальних змаганнях Гімназіади України 2018 року з легкої атлетики серед дівчат у програмі естафетного бігу з результатом 2.21.7
1. Диплом за участь у міських змаганнях з легкої атлетики (4-х борство) по програмі міських спортивних ігор "Олімпійські надії" серед учнів закладів середної освіти
1. Диплом за участь у міських змаганнях з легкої атлетики (4-х борство) по програмі міських спортивних ігор "Олімпійські надії" серед учнів закладів середної освіти
1. Диплом за участь у міських змаганнях з легкої атлетики (4-х борство) по програмі міських спортивних ігор "Олімпійські надії" серед учнів закладів середної освіти
1. Диплом за участь у міських змаганнях з легкої атлетики (4-х борство) по програмі міських спортивних ігор "Олімпійські надії" серед учнів закладів середної освіти
1. Диплом за зайняте перше місце в міських змаганнях з легкої атлетики (4-х борство) по програмі міських спортивних ігор "Олімпійські надії" серед учнів закладів середної освіти, з результатом 759 оч
1. Нагороджується КЗШ І-ІІІ ст. №55 за зайняте ІІ місце в спортивних іграх "Олімпійські надії" зональних обласних змаганнях з легкоатлетичного чотириборства серед учнів закладів освіти
`}</Md>
      </Tab>

      <Tab title="2017">
        <Md>{`
1. Грамота за І місце в Чемпіонаті області з легкої атлетики серед дівчат 2003-2004 р.н. в бігу на 60 м з результатом 8 секунд
1. Грамота за ІII місце в Чемпіонаті області з легкої атлетики серед дівчат 2003-2004 р.н. в бігу на 60 з/п з результатом 9,55 секунд
1. Грамота за участь в обласній виставці молодших школярів з початкового технічного моделювання
1. Грамота за перемогу у міській туристсько-краєзнавчої акції «Літо - вивчаємо ріднокрай», робота «Історична спадщина Тернівської землі»
1. Диплом за ІІ місце в першості міста з легкої атлетики серед загальноосвітніх шкіл, на дистанції 400м, з результатом 1.09,6
1. Диплом за ІІ місце в першості міста з легкої атлетики серед загальноосвітніх шкіл, на дистанції 60м, з результатом 8,2 сек
1. Диплом за ІІ місце в першості міста з легкої атлетики серед загальноосвітніх шкіл, на дистанції 100м, з результатом 13.5 сек
1. Диплом за ІІ місце в першості міста з легкої атлетики серед загальноосвітніх шкіл, у стрибках в довжину, з результатом 4м 44см
1. Диплом за І місце в першості міста з легкої атлетики серед загальноосвітніх шкіл, на дистанції 100м, з результатом 13.3 сек
1. Диплом за І місце в першості міста з легкої атлетики серед загальноосвітніх шкіл, на дистанції 60м, з результатом 8.1 сек
1. Диплом за ІІІ місце в першості міста з легкої атлетики серед загальноосвітніх шкіл, у стрибках в довжину, з результатом 4м 19см
1. Грамота за І місце в обласній Олімпіаді з легкоатлетичного чотириборства
1. Грамота за І місце в міських змаганнях з "Легкоатлетичного 4-х борства" спортивних ігор "Олімпійські надії" серед учнів загальноосвітніх навчальних закладів
1. Грамота за ІІІ місце в змаганнях з волейболу серед юнаків загальноосвітніх шкіл Тернівського району (2001 р.н. та молодше)
1. Грамота за ІІІ місце у міському турі Всеукраїнського конкурсу колективів екологічної просвіти "Земля - наш спільний дім" за напрямом "Ландшафти як середовище життя та об'єкти охорони"
1. Грамота за ІІІ місце у міських спортивних іграх «Олімпійські надії» зі стрітболу серед учнів загальноосвітніх шкіл 2002 р.н. і молодше.
1. Грамота за ІІ місце в турнірі з баскетболу 3х3 (стрітбол) серед юнаків загальноосвітніх шкіл Тернівського району (2002 р.н. та молодше).
1. Грамота за ІІ місце в турнірі з баскетболу 3х3 (стрітбол) серед юнаків загальноосвітніх шкіл Тернівського району (1999 р.н. та молодше).
`}</Md>
      </Tab>

      <Tab title="2016">
        <Md>{`
1. За кращий показник в урочистому проходженні маршем та виконання стройової пісні у районних змаганнях за програмою всеукраїнської дитячої-юнацької військово-патріотичної гри "Сокіл" ("Джура") серед учнів 10-11 класів загальноосвітніх шкіл Тернівського району.
1. За зайняте ІІ місце у загальному заліку в районних змаганнях за програмою Всеукраїнської дитячо-юнацької, віськово-патріотичної гри «Сокіл» («Джура») серед учнів 10-11 класів загальноосвітніх шкіл Тернівського району.
1. Подяка директору КЗШ І-ІІІ ст. № 55 Горевич Л. В. за плідну співпрацю по розвитку освітніх можливостей молоді заохочену її щодо отримання вищої освіти в кращих навчальних закладах Європи, спільний внесок у загальнодержавну справу Євроінтеграції.
1. ІІІ місце у міському огляді-конкурсі на краще зовнішнє оформлення навчального закладу «Зимове мереживо» міського новорічного фестивалю «Новорічні дива» серед закладів освіти міста.
1. Подяка команді КЗШ І-ІІІ ст. № 55 за активну участь у міському (зональному) етапі огляді-конкурсі загонів Юних інспекторів руху серед загальноосвітніх навчальних закладів, присвяченого 71-річниці відзначення Дня Перемоги над нацизмом у Другій світовій війні та 241-ї річниці від дня заснування міста Кривого Рогу.
1. Грамота виконкому Тернівської районної у місті ради за перемогу та зайняті призові місця в інтелектуальних, творчих конкурсів Всеукраїнського, обласного, міського рівнів та з нагодни Дня працівників освіти.
1. Грамота виконкому Тернівської районної у місті ради за найкращу організацію та оформлення експозиції тематичної виставки серед загальноосвітніх навчальних закладів району з нагоди 25-річчя незалежності України.
1. Грамота виконкому Тернівської районної у місті ради за проявлену творчу ініціативу в оформлені святкового короваю серед учасників виставки короваїв «На щастя, на долю» з нагоди 25-річчя незалежності України.
1. Грамота за І місце у відкритій міській виставці-конкурсі з історико-музейного стендового моделювання і музейно-виставкових експозицій, присвяченої сьогоденню та героїчному минулому українського народу в рамках міської акції «Виховуємо нащадків патріотів», номінація «Відтворення козацької доби».
1. Грамота за ІІІ місце в міському конкурсі на кращий інтернет-сайт загальноосвітнього навчального закладу.
1. Грамота за ІІ місце в Спортивних іграх серед вчителів та батьків загальноосвітніх шкіл Тернівського району присвячених відзначенню 72-ї річниці визволення міста Кривого Рогу від фашистських загарбників.
1. Подяка від генерального директора ПІВНГЗК за особистий внесок в реалізацію програми «Школа-ВНЗ-комбінат», відданість праці та активну участь у професійній орієнтації учнівської молоді.
1. Грамота за І місце в змаганнях з футболу «Золота бутса» серед загальноосвітніх навчальних закладів Тернівського району.
1. Диплом за участь у конкурсі проектів серед учнів «Відновлення мого місця проживання».
`}</Md>
      </Tab>

      <Tab title="2015">
        <Md>{`1. За зайняте І місце серед загальноосвітніх навчальних закладів Тернівського району в організації та оформлені експозиції тематичної виставки з нагоди 24-ої річниці незалежності України.`}</Md>
      </Tab>
    </Tabs>
  );
}
