import Md from "components/md";

export default function Needs() {
  return (
    <>
      <h1>
        Орієнтовний перелік потреб навчального закладу станом на 01.09.2018 рік
        та виконано станом на 01.09.2019
      </h1>
      <Md>{`
1. Капітальний ремонт шиферної покрівлі приміщення школи
1. Капітальний ремонт м’якої покрівлі приміщення школи **(здійснено ремонт покрівлі спортивної зали у травні 2019р.)**
1. Заміна вікон на металопластикові енергозберігаючі **(здійснено частково у грудні 2018 – січні 2019)**   
   Ремонт актової зали:
   - облаштування покриттям сцени **(здійснено у листопаді-грудні 2018 р. за рахунок перемоги у грантовому проекті «Клас Метінвест»)**
   - поновлення стільців **(здійснено у грудні 2018р. за рахунок перемоги у грантовому проекті «Клас Метінвест»)**
   - облаштування сцени завісою **(здійснено у листопаді-грудні 2018р.)**
   - покриття підлоги лінолеумом **(здійснено у листопаді-грудні 2018р. за рахунок перемоги у грантовому проекті «Клас Метінвест»)**
1. Капітальний ремонт 2-х туалетів для хлопчиків та 2-х туалетів для дівчаток ІІ поверх ліве крило **(здійснено у вересні-жовтні 2018 р. за рахунок міського бюджету)**
1. Капітальний ремонт 2-х туалетів для хлопчиків та 2-х туалетів для дівчаток ІІІ поверх ліве крило **(виконано до 20.06.2019 р. облицювальні роботи за рахунок міського бюджету)**
1. Установлення водонагрівачів ІІІ поверх ліве крило
1. Капітальний ремонт спортивних залів, роздягалень, душових кімнат **(здійснено ремонт рекреації між малою та великою спортивною залою: фарбування панелей, підлоги декорування та фарбування стін, стелі)**
1. Часткова заміна освітлення коридорів школи **(замінено освітлення на ІІ поверсі правого крила школи)**
1. Ремонт та часткова заміна електропроводки приміщень школи **(здійснено ревізію освітлення коридорів І,ІІ,ІІІ поверхів)**
1. Білування стелі коридорів школи; частковий ремонт **(шпаклювання та фарбування) панелей коридорів; фарбування підлоги (здійснено капітальний ремонт правого крила ІІ поверху рекреації початкової школи)**.
1. Здійснення обслуговування оргтехніки **(здійснюється упродовж навчального року – в разі потреби, за рішенням батьківського комітету)**
1. Вдосконалення системи протипожежного захисту **(здійснено обслуговування та заправку  49 вогнегасників  у березні 2019 р.); надано за рахунок міського бюджету 20 шт.**
1. Облаштування вікон закладу тюлем **(здійснено частково на І поверсі за рахунок спонсорських небатьківських коштів)**
1. Облаштування підлоги школи лінолеумом
1. Заміна дверей приміщень навчальних кабінетів **(виконано частково, за рішенням класних батьківських комітетів)**
1. Заміна меблів у класних кімнатах **(виконано частково, за рішенням класних батьківських комітетів)**
1. Оснащення навчальних кабінетів закладу сучасною оргтехнікою **(виконано частково, за рішенням класних батьківських комітетів)**
1. Часткова заміна системи водо- та теплопостачання **(здійснюється упродовж навчального року, за потреби та за рішенням батьківського комітету)**
1. Здійснення обслуговування системи відеоспостереження та вдосконалення обладнання **(здійснюється упродовж навчального року – заміна прожекторів освітлення, що вийшли з ладу, підсилення освітлення зовнішнього периметру навчального закладу – за рішенням батьківського комітету)**
1. Ремонт навчальних кабінетів **(здійснено ремонт кабінету поділу на групи для вивчення окремих предметів у початкових класах)**
1. Поточний ремонт 1 туалету І поверх праве крило **(здійснено часткове шпаклювання та білування стін, стелі, фарбування дверей, панелей)**
1. Фарбування спортивних снарядів на шкільному стадіоні **(виконано до 20.08.2019)**
`}</Md>
    </>
  );
}
