import Md from "components/md";

export default function ConditionsOfAvailability() {
  return (
    <Md>{`

Заклад збудовано за типовим проектом у 1975 році. Відповідно до типових планів у закладі не було передбачено  зручностей для вільного пересування людей з обмеженими можливостями.

КЗШ І-ІІІ ступенів №55 забезпечує умови для навчання дітей з особливими освітніми потребами, які можуть самостійно пересуватись.

Доступ до приміщення школи для осіб з особливими потребами можливий тільки на І поверх.

# Щодо виконання вимог Закону України "Про основи соціальної захищеності інвалідів в Україні"

Довжина пандуса - 3 м

Ширина - 0,9 м

Висота - 60 см

Висота дверей - 2,15 м

Ширина - 1,70 м

Кнопка виклику знаходиться на висоті 1,30 м
`}</Md>
  );
}
