import Link from "components/link";
import Md from "components/md";
import Pdf from "components/pdf";
import styled from "styled-components";
import { Cell, Grid } from "styled-css-grid";

const contacts = ["reception@school55.pp.ua", "kzh55@ukr.net"];

export default function Structure() {
  return (
    <>
      <Header>Адміністрація закладу</Header>
      <Person
        photo="gorevich_l_v"
        post="Директор школи"
        name="Горевич Людмила Володимирівна"
        contacts={contacts}
        time={[["Понеділок", "08:30 - 09:00", "11:15 - 16:00"]]}
      >
        <Md>{`
# Відповідає за

- Забезпечення школи кадрами, прийом на роботу і звільнення з роботи навчально – допоміжного та обслуговуючого персоналу школи
- Організацію та проведення атестації учителів і подання атестаційних листів та документів для нагородження педпрацівників та встановлення їм вищої категорії до атестаційних комісій вищого рівня
- Підготовку та проведення педагогічних рад, нарад за участю директора
- Правильне складання річного плану роботи школи і плану її перспективного розвитку
- Підготовку школи до нового навчального року
- Належне ведення особових справ
- Здійснення набору учнів до 1-х та 10-х класів, прийом дітей до школи
- Дотримання єдиних педагогічних вимог у школі, режиму навчальних занять
- Дотримання санітарно-гігієнічного режиму в навчальних кабінетах
- Створення сприятливих умов для підвищення професійного рівня працівників школи
- Правильність організації навчально-виховної роботи з учнями 1 – 11 класів
- Організацію і якість навчально-виховної роботи серед учнів, зміцнення їх здоров’я та фізичний розвиток
- Забезпечення належного фінансово – господарського стану школи
- Забезпечення об’єктивності оцінювання знань, умінь та навичок учнів
- Поповнення бібліотеки навчально-методичної літературою, профільними журналами та газетами
- Правильне планування та організацію вивчення предметів початкових класів, хімії, біології
- Ведення класних журналів 1-4 класів та ведення шкільної документації
- Організацію та облік бланків документів на отримання документів про освіту
- Організацію роботи з учнями та їхніми батьками
- Підготовку та проведення педагогічних читань, науково – практичних конференцій, аукціонів педагогічних ідей, узагальнення й поширення перспективного педагогічного досвіду

# Безпосередньо керує

- Роботою заступників із навчально – виховної роботи, виховної роботи, завгоспа
- Роботою шкільної ради, педагогічної ради та педагогічного колективу
- Бібліотекою школи
- Підготовкою та проведенням ДПА

# Організовує

- Роботу відповідно до річного плану роботи школи
- Роботу з батьками і громадськими організаціями
- Підготовку і проведення методоперативок з учителями

# Погоджує

- свою діяльність із районним відділом освіти, міським та обласним управліннями освіти

# Здійснює контроль за

- Виконанням річного плану роботи школи, навчальних планів, рішень педагогічної ради та рекомендацій нарад за участю директора
- Викладання предметів початкових класів, хімії, біології

# Організацією харчування в школі

- Виконання єдиних педагогічних вимог, дотримання санітарно – гігієнічного режиму
- Роботою навчальних кабінетів
- Станом збереження й використанням навчально – матеріальної бази

# Звітує

- Про організацію, здійснення та результати навчально – виховної роботи і стан матеріально – технічного забезпечення школи перед органами управління світовою та іншими вищими владними органами, батьками

# Складає

- Річний та перспективний план роботи школи, графік роботи адміністрації, видає накази, розпорядження та інші документи, які стосуються шкільного життя
- Графік роботи вчителів під час канікул
`}</Md>
      </Person>
      <Person
        photo="furt_s_v"
        post="Заступник директора з навчально-виховної роботи"
        name="Фурт Світлана Володимирівна"
        contacts={contacts}
        time={[
          ["Середа", "08:00 - 16:00"],
          ["П'ятниця", "08:00 - 16:00"],
        ]}
      >
        <Md>{zdnvr}</Md>
      </Person>
      <Person
        photo="livak_v_v"
        post="Заступник директора з навчально-виховної роботи"
        name="Лівак Вікторія Вікторівна"
        contacts={contacts}
        time={[
          ["Середа", "08:00 - 16:00"],
          ["П'ятниця", "08:00 - 16:00"],
        ]}
      >
        <Md>{zdnvr}</Md>
      </Person>
      <Person
        photo="altinbaeva_l_m"
        post="Заступник директора з виховної роботи"
        name="Алтинбаєва Лариса Миколаївна"
        contacts={contacts}
        time={[
          ["Вівторок", "08:00 - 16:00"],
          ["Четвер", "08:00 - 16:00"],
        ]}
      >
        <Md>{`
# Відповідає за

- Планування, організацію та облік виховної роботи з учнями 1 – 11 класів;
- Роботу громадських  організацій, різноманітних клубів, предметних гуртків, проведення тематичних вечорів у школі;
- Організацію та облік працевлаштування випускників 9-х та 11-х класів;
- Роботу клубу правових знань старшокласників;
- Роботу методичних об’єднань класних керівників;
- Підготовку та проведення загальношкільних заходів (свят, вечорів, диспутів, естафет, конкурсів тощо);
- Дотримання санітарно – гігієнічного режиму в навчальних кабінетах;
- Виконання правил техніки безпеки в школі та оформлення документів з техніки безпеки;
- Зв'язок із позашкільними громадськими організаціями;
- Випуск загальношкільних стінних газет та їх зміст;
- Організацію відвідування учнями позашкільних навчально – виховних закладів, музеїв, театрів, їхньої участі в екскурсіях тощо;
- Організацію та облік роботи інспектора з охорони дитинства та громадського інспектора щодо запобігання дитячому травматизму;
- Організацію роботи щодо запобігання бездоглядності школярів і скоєнню ними правопорушень;
- Індивідуальну роботу з дітьми, схильними до асоціальної поведінки, та роботу з неблагополучними сім’ями;
- Зв'язок зі службами у справах неповнолітніх, органами міліції;
- Організація художньої самодіяльності;
- Організацію санітарних штатів та чергування по школі класних колективів;
- Організацію та проведення суспільно корисної діяльності в 1 – 11 класах;
- Створення й функціонування дитячих організацій та органів учнівського самоврядування в 1 – 11 класах;
- Планування позаурочної роботи з дітьми та власної управлінської діяльності;
- Організацію вивчення, узагальнення й поширення перспективного досвіду виховної роботи;
- Забезпечення дотримання правил техніки безпеки і санітарно – гігієнічних норм під час проведення виховних заходів, робіт;
- Організацію просвітницької роботи для батьків (прийом батьків або осіб, що їх замінюють) з питань виховання дітей;
- Виконання річного плану роботи школи;
- Організацію досліджень та експериментів під час здійснення виховного процесу;
- Організацію та облік роботи інспектора з охорони дитинства;
- Організацію та облік працевлаштування випускників 9-х та 11-х класів;
- Організацію дотримання законодавства про загальну середню освіту з метою забезпечення охоплення дітей і підлітків повною загальною середньою освітою, захисту прав дітей та отримання освіти;
- Організацію діяльності комісії з превентивного виховання з напрямку розв’язання питання про взяття  на внутрішкільний  облік учнів, що схильні до правопорушень, забезпечує зв’язок з інспекцією у справах неповнолітніх, кримінальною міліцією; надає методичну допомогу класним керівникам в організації та проведенні заходів щодо правопорушень; координує діяльність психолога, соціального педагога та класних керівників; сприяє пропаганді правових знань серед учнів; планує роботу постійно діючої комісії з питань попередження негативних проявів серед учнів.

# Керує

- Роботою класних керівників щодо організації навчальної діяльності учнів, формування в них свідомого ставлення до навчання;
- Роботою практичного психолога, педагога-організатора, соціального педагога;
- Діяльністю класних керівників та класоводів щодо організації виховної роботи в класах;
- Роботою органів учнівського самоврядування;
- Проведенням загальношкільних заходів, традиційних свят і заходів за планами органів влади;
- Роботою методичного об’єднання класних керівників.


- Розробляє разом із психологом школи систему діагностики та аналізу змін у розвитку школярів та громадянського виховання.

# Координує

- Роботу вихователів, класних керівників та інших підлеглих йому працівників;
- Роботу з розробки необхідної методичної документації.

# Організовує

- Планування виховної роботи в школі;
- Роботу чергового класу, старшого чергового вчителя;
- Підготовку і проведення загальношкільних заходів виховного спрямування;
- Проведення інструктивно – методичної роботи з класними керівниками та організаторами позаурочної діяльності дітей;
- Роботу із соціального захисту дітей із неблагополучних сімей, а також дітей, які схильні до правопорушень або скоїли їх;
- Створення дитячих організацій та органів учнівського самоврядування; роботу гуртків художньої самодіяльності, ужиткового мистецтва, технічної творчості тощо;
- Проведення заходів морально – правового спрямування із залученням працівників правоохоронних органів;
- Захист прав та інтересів учнів;
- Систематичне проведення заходів із профілактики правопорушень та формування в учнів правової грамотності, виявлення причин скоєних ними правопорушень;
- Проведення заходів щодо запобігання травматизму, дорожньо – транспортними пригодами, нещасними випадками, які трапляються на вулиці та в інших місцях;
- Відкриті виховні заходи та їх відвідування класними керівниками школи.

# Сприяє

- Створенню комплексної системи виховання, служби інформації для класних керівників;
- Проведенню експериментальної роботи класними керівниками.


- Погоджує свою діяльність із директором школи, методичним кабінетом відділу освіти, міським методичним центром департаменту освіти міськвиконкому, кабінетом виховної роботи інституту удосконалення учителів, із заступниками директора навчально – виховної роботи.

# Здійснює контроль за

- Роботою класних керівників щодо організації виховної діяльності учнів;
- Позаурочною роботою, діяльністю вчителів, що її здійснюють;
- Проведенням аналізу результативності виховної роботи в школі, якості роботи окремих педагогічних працівників;
- Виконання планів виховної роботи класними керівниками та класоводами;
- Проведенням спортивно – масової діяльності, військово – патріотичної та краєзнавчої роботи;
- Виконанням санітарно – гігієнічних норм, правил з охорони праці, пожежної безпеки під час проведення виховних заходів за межами навчального закладу;
- Випуском загальноосвітніх стінних газет та їх змістом;
- Якістю проведення класних годин, позашкільних та позакласних заходів;
- Якістю ведення шкільної документації.

# Інструктує й консультує

- Класних керівників та вчителів, щодо проведення виховної роботи з учнями, новинок методичної літератури з проблем виховання школярів, у тому числі з питань охорони праці учнів, запобігання травматизму та іншим нещасним випадкам;
- Батьків та батьківський актив щодо організації виховної роботи з учнями;
- Членів дитячих формувань;
- Учнівські колективи щодо проведення культурно – оздоровчих заходів;
- Учнів школи з питань охорони праці, техніки безпеки, виробничої санітарії та пожежної безпеки (із оформленням відповідної документації).


- Надає допомогу педагогічним працівникам в опанування та розробці інноваційних виховних програм і технологій.

# Здійснює облік

- Проведення класними керівниками та керівниками гуртків, клубів, об’єднань класних годин, позакласних занять;
- Чергування класів, учителів;
- Роботи органів учнівського самоврядування;
- Профілактику правопорушень та травматизму в мікрорайоні школи;
- Звітів про кількість дітей у мікрорайоні школи та працевлаштування учнів випускних  класів.


- Звітує про організацію та здійснення виховної роботи в школі перед директором, педагогічною радою, відділом освіти та іншими органами.

# Складає

- План виховної роботи на кожний навчальний рік та календарний план виховної роботи;
- Письмовий звіт директору школи про свою діяльність протягом 10 днів після закінчення кожного семестру;
- Графік чергування класів по школі;
- Графік здійснення суспільно – корисної діяльності;
- Проекти наказів, розпоряджень та іншої документації з питань виховної роботи;
- Розклад роботи гуртків.
`}</Md>
      </Person>
      <Person
        photo="chernyavska_a_a"
        post="Соціальний педагог"
        name="Чернявська Алла Анатоліївна"
        contacts={contacts}
      >
        <Md>{`
# Відповідає за

- Планування, організацію та облік роботи з дітьми пільгової категорії;  
- Організацію роботи із соціально – незахищеними дітьми;
- Організацію просвітницької роботи для батьків або осіб, що їх замінюють з питань охорони дитинства;
- Роботу із соціального захисту дітей із неблагополучних сімей;
- Індивідуальне консультування учнів, батьків та вчителів;
- Індивідуальну роботу з дітьми, схильними до асоціальної поведінки, та роботу з неблагополучними сім’ями;
- Надання соціально – педагогічної допомоги учням і сім’ям, які потребують особливої уваги;
- Перепис мікрорайону вчителями школи;
- Організацію дотримання законодавства про загальну середню освіту з метою забезпечення охоплення дітей і підлітків повною загальною середньою освітою, захисту прав дітей та отримання освіти;
- надання методичної допомогу по роботі  з «проблемними підлітками» та прийняття правильних рішень постійно діючої комісії з превентивних питань.
- Організацію харчування учнів школи та дітей пільгових категорій.

# Здійснює

- Посередництво між освітніми установами, сім’єю та школою;
- Залучення дітей до позакласної та позашкільної освіти;
- Облік дітей шкільного віку в мікрорайоні школи;
- Зв'язок зі службами у справах неповнолітніх, органами міліції;
- Контроль за організацією харчування в школі.

# Виявляє

- Дитячі угрупування соціального ризику, конфліктні ситуації в класних колективах;
- Випадки вживання до дітей будь-яких форм фізичного та психологічного насильства.

# Організовує

- Ділові ігри, тренінги з педагогами;
- Роботу психологічного семінару «Педагогіка особистості, як аспект гармонізації стосунків учасників педагогічного процесу»;
- Педагогічні читання по роботі над проблемою школи; 
- Відпочинок учнів, зокрема дітей – сиріт, дітей із багатодітних та малозабезпечених, неблагополучних сімей, у канікулярний період;
- Надання соціально – педагогічної допомоги учням і сім’ям, які потребують особливої уваги.

# Складає

- Списки дітей – сиріт, дітей із багатодітних та неблагополучних сімей, підлітків, які скоїли правопорушення або виявили схильність до протиправної поведінки;
- Соціальну характеристику сімей, де виховуються такі діти;
- Списки дітей перепису мікрорайону;
- Звіт про кількісний склад учнів у мікрорайоні.
`}</Md>
      </Person>
      <Person
        photo="hrustaleva_o_v"
        post="Практичний психолог"
        name="Хрустальова Оксана Валентинівна"
        contacts={contacts}
      >
        <Md>{`
# Відповідає за

- Проведення психологічної діагностики, обробку її результатів, оформлення висновків та рекомендацій;
- Проведення групової психодіагностики, обробку її результатів, оформлення психологічного висновку, оформлення психологічного висновку;
- Індивідуальне консультування учнів, батьків та вчителів;
- Проведення профконсультацій з учнями школи, індивідуальне коригування поведінки учнів;
- Проведення тестування, анкетування по виявленню учнів, схильних до правопорушень, виявляє причини, надання рекомендацій класним  керівникам  в роботі з «проблемними підлітками»; виявлення неформальних лідерів в класному колективі; забезпечення зв’язку з лікарнею, наркокабінетом, проведення бесіди з учнями школи.

# Організовує

- Ділові ігри, тренінги з педагогами;
- Підготовку та проведення психолого – педагогічного консиліуму.

# Бере участь

- У підготовці до проведення виховних годин для учнів;
- У педагогічних радах, нарадах за участю директора;
- У консультаціях у наукових центрах, методичних семінарах шкільних психологів;
- У роботі бібліотеки;
- У зборах або конференціях працівників школи.

# Веде документацію

- Визначену Положенням про шкільного психолога, затвердженим Міністерством освіти і науки України;
- Присвячену узагальненню результатів своєї роботи, звітуванню про неї;
- В якій висвітлюються результати педагогічного консиліуму.


- Погоджує свою діяльність із заступником директора з навчально – виховної роботи та заступником директора з виховної роботи, відділом освіти виконкому райради.
`}</Md>
      </Person>
      <Person
        photo="petrushevska_l_g"
        post="Завідувач господарства"
        name="Петрушевська Людмила Григорівна"
        contacts={contacts}
      >
        <Md>{`
# Відповідає за

- Збереження будівлі та шкільного майна
- Матеріально – технічне забезпечення навчального процесу (освітлення, опалювання, водопостачання, наявність належного обладнання й устаткування)
- Чистоту і порядок у шкільному приміщенні
- Організацію чергування технічного персоналу
- Розподіл обов’язків між технічними працівниками школи
- Організацію поточного ремонту шкільної будівлі та класних кімнат
- Дотримання санітарно – гігієнічного режиму в школі
- Інвентаризацію шкільного майна та шкільних кабінетів
- Складання документації для нарахування зарплати техперсоналу
- Проведення санітарного четверга
- Виконання заходів щодо розширення господарської самостійності школи, своєчасне укладання необхідних угод
- Дотримання вимог щодо охорони праці під час експлуатації головної будівлі та інших приміщень школи, технологічного, енергетичного обладнання
- Дотримання норм пожежної безпеки в школі
- Справність засобів пожежогасіння

# Керує

- Роботою технічного персоналу щодо прибирання шкільних приміщень, пришкільною території
- Роботою сторожів та робітників, технічного персоналу школи
- Господарською діяльністю школи
- Роботою з благоустрою, озеленення і прибирання території школи

# Організовує

- Роботу щодо забезпечення дотримання санітарно – гігієнічних норм під час навчального процесу
- Постачання необхідних матеріалів для безперервної роботи всіх служб
- Інвентарний облік майна школи, проведення інвентаризації майна
- Дотримання вимог щодо охорони праці під час експлуатації головної будівлі та інших приміщень школи, технологічного та енергетичного обладнання
- Здійснення періодичного огляду, поточного ремонту приміщень та обладнання
- Дотримання норм пожежної безпеки в будівлях і спорудах, нагляд за станом засобів пожежогасіння
- Проведення щорічних замірів опору ізоляції електроустановок і електропроводки, пристроїв заземлення, їх періодичне випробування, вимірювання рівня освітленості, радіації, шуму в приміщеннях школи (визначення його відповідності правилам і нормам безпеки життя)
- Розробку інструкцій з охорони праці для техперсоналу не рідше ніж 1 раз на 5 років
- Навчання й інструктаж на робочому місці (вступний і періодичний) технічного та обслуговуючого персоналу

# Погоджує

- свою діяльність із директором школи, заступниками директора, з інженерно – технічним наглядом відділу освіти, бухгалтерією

# Здійснює контроль за

- Роботою всіх працівників технічно – обслуговуючого персоналу школи
- Збереженням матеріально – технічного устаткування в кабінетах
- Дотримання санітарно – гігієнічних норм у приміщенні школи, раціональністю витрат матеріалів та коштів школи

# Інструктує й консультує

- Обслуговуючий персонал щодо утримання матеріально – технічного забезпечення
- Технічний персонал з питань техніки безпеки

# Здійснює облік

- Інвентаризації шкільного майна
- Роботи завідувачів щодо матеріально – технічного забезпечення
- Зберігання протипожежного обладнання

# Звітує

- про підготовку школи до нового навчального року та готовність до роботи в осінньо – зимовий період

# Складає

- Графік роботи технічно – обслуговуючого персоналу
- Табель на заробітну плату технічно – обслуговуючого персоналу
- Проекти наказів, розпоряджень та інших документів з питань господарської роботи
- Акти списання майна, яке вийшло з ладу
- Плани проведення ремонтних робіт у приміщеннях школи під час підготовки до нового навчального року
- Документи для надання органами, що мають відповідні повноваження, дозволу експлуатувати шкільне приміщення у поточному навчальному році
`}</Md>
      </Person>
      <Header>
        Структура органів управління відповідно до Статуту закладу
      </Header>
      <Schema src="/public-info/structure-and-organization.jpg" />
      <Header>Витяг зі статуту закладу</Header>
      <Pdf src="/public-info/structure-and-organization.pdf" />
    </>
  );
}

const zdnvr = `
# Відповідає за

- Організацію та проведення атестації учителів і подання атестаційних листів та документів для нагородження педпрацівників та встановлення їм вищої категорії до атестаційних комісій вищого рівня
- Правильне планування та організацію вивчення української мови та літератури, російської мови та світової літератури, іноземних мов, історії та правознавства
- Своєчасне складання й коригування розкладу уроків
- Виконання навчальних планів і програм учителями початкової школи, української мови та літератури, російської мови та світової літератури, іноземних мов, історії та правознавства
- Забезпечення ефективності їхньої роботи, зокрема високої якості знань, умінь і навичок учнів
- Ведення класних журналів та іншої документації у 5-8 класах
- Дотримання санітарно-гігієнічного режиму в навчальних кабінетах: хімії, біології
- Створення сприятливих умов для підвищення професійного рівня працівників школи
- Створення сприятливого морально – психологічного клімату в педагогічному колективі
- Вивчення, узагальнення і впровадження перспективного педагогічного досвіду учителів школи
- Впровадження досягнень педагогічної науки в практику навчально-виховної роботи вчителів, реалізацію принципів наукової організації праці та гуманізації взаємовідносин у колективі
- Підготовку звітних документів по школі, складання документів для нарахування заробітної плати вчителям та іншим працівникам школи, зв'язок з бухгалтерією з питань виплати зарплати працівникам школи
- Проходження вчителями курсової перепідготовки
- Виконання правил техніки безпеки в школі та оформлення документів з техніки безпеки
- Підготовку та проведення педагогічних читань, науково – практичних конференцій, аукціонів педагогічних ідей, узагальнення й поширення перспективного педагогічного досвіду
- Дотримання єдиних педагогічних вимог у школі, режиму навчальних занять

# Безпосередньо керує

- Роботою вчителів 1 – 11 класів та вчителів предметів природничого циклу
- Проведенням контрольних, практичних і лабораторних робіт, навчальних екскурсій
- Роботою завідувачів кабінетів
- Роботою лаборанта
- Роботою методичної ради, методичних об’єднань та методичного кабінету. - Підготовкою та проведенням ДПА

# Організовує

- Роботу з планування засвоєння учнями навчального матеріалу з української мови та літератури, російської мови та світової літератури, іноземних мов, історії та правознавства
- Проведення факультативних занять, спецкурсів за вибором
- Дотримання у школі єдиних педагогічних вимог та режиму навчальних занять
- Проведення відкритих уроків і взаємовідвідування уроків вчителями
- Роботу з учнями, які за заявою батьків та у зв’язку зі станом здоров’я працюють за індивідуальними планами відповідно до чинного положення
- Перепідготовку працівників школи та проходження атестації педагогічними працівниками
- Підготовку й проведення методичних «оперативок» з учителями
- Підготовку матеріалів до складання річного плану
- Розробку інструкцій з охорони праці для педпрацівників не рідше 1 разу на 3 роки
- Навчання з охорони праці для працівників школи
- Розробку документів з цивільного захисту школи
- Своєчасну заміну уроків

# Погоджує

- свою діяльність із директором школи, з іншими заступниками директора, з методичним центром управління освіти міськвиконкому, інноваційно-методичним центром та інспекторами відділу освіти

# Здійснює контроль за

- Роботою вчителів української мови та літератури, російської мови та світової літератури, іноземних мов, історії та правознавства
- Станом успішності учнів 1-11 класів
- Навчальним навантаженням учнів
- Дотриманням у школі єдиних педагогічних вимог, режиму навчальних занять
- Проведенням контрольних робіт та інших обов’язкових робіт, визначених програмою

# Інструктує й консультує

- Учителів предметів природничого циклу щодо складання перспективних і поурочних планів
- Завідувачів кабінетів біології, хімії, з питань організації ефективної роботи навчальних кабінетів
- Вчителів щодо проведення навчальних занять і організації самоосвіти
- Вчителів, щодо складання планів і звітів

# Здійснює облік

- Виконання державних програм, календарних і тематичних планів
- Статистичних документів
- Перевірки введення іншої документації
- Роботи методичного кабінету та методичних комісій
- Засідань атестаційних комісій
- Замінених уроків

# Звітує

- Про організацію, стан і результати навчальної роботи перед директором та педагогічною радою, перед батьками

# Складає

- Розклад уроків, факультативів, курсів за вибором
- Розклад використання кабінетів
- Графіки контрольних робіт та проведення зрізів знань наприкінці І і ІІ семестрів
- Розклад державної підсумкової атестації та консультацій для вчителів щодо підготовки до неї
- Звіт про стан успішності учнів наприкінці І та ІІ семестрів
- Звіт по зміни кількості учнів у школі, який має узгоджуватися з алфавітною книгою
- Табелі на зарплату педагогічних працівників
- Проекти наказів, розпоряджень, інформаційних матеріалів та довідок із питань навчально – виховного процесу
`;

const Person = (props) => {
  return (
    <Root>
      <Grid columns="15vw 1fr">
        <Cell>
          <Photo src={`/teachers/${props.photo}.jpg`} />
        </Cell>
        <Cell>
          <Post>{props.post}</Post>
          <Name>{props.name}</Name>
          <Contacts>
            Контактна інформація:
            <ul>
              {props.contacts.map((contact) => (
                <li key={contact}>
                  <Link to={`mailto:${contact}`}>{contact}</Link>
                </li>
              ))}
            </ul>
          </Contacts>
        </Cell>
        <Cell width={2}>
          <Content>{props.children}</Content>
          {props.time && (
            <>
              <Time>Години прийому</Time>
              <table>
                <tbody>
                  {props.time.map((day) => (
                    <tr key={day[0]}>
                      <td>{day[0]}</td>
                      <td>
                        {day.slice(1).reduce((a, e, i) => {
                          return a === null ? [e] : [...a, <br key={i} />, e];
                        }, null)}
                      </td>
                    </tr>
                  ))}
                </tbody>
              </table>
            </>
          )}
        </Cell>
      </Grid>
      <Separator />
    </Root>
  );
};

const Root = styled.div`
  font-family: "roboto condensed";
  font-size: 1.3vw;
`;

const Photo = styled.img`
  width: 100%;
  display: block;
`;

const Post = styled.div`
  font-weight: bold;
`;

const Name = styled.div`
  color: #a716a7;
  font-weight: bold;
`;

const Contacts = styled.div`
  margin-top: 20px;
`;

const Header = styled.h1`
  text-align: center;
`;

const Schema = styled.img`
  width: 70%;
  margin: 0 auto;
  display: block;
`;

const Content = styled.div`
  h1 {
    font-size: inherit;
    text-align: left;
    color: blue;
  }
`;

const Time = styled.h1`
  font-size: inherit;
  color: blue;
`;

const Separator = styled.div`
  height: 50px;
  width: 100%;
`;
