import Md from "components/md";
import { Tab, Tabs } from "components/tabs";
import { css } from "styled-components";
import { Cell, Grid } from "styled-css-grid";

export default function DevelopmentProgram() {
  return (
    <span
      css={css`
        h1,
        h2 {
          font-family: philosopher;
          font-style: italic;
          text-align: center;
        }
      `}
    >
      <Tabs>
        <Tab title="Програма інноваційного розвитку">
          <img
            src="/development-program/logo.png"
            css={css`
              width: 15vw;
              position: absolute;
              right: 0;
              top: 50px;
            `}
          />

          <h1>
            Програма інноваційного розвитку
            <br />
            КЗШ І-ІІІ ст. № 55
            <br />
            на 2014-2021 роки
          </h1>
          <h2>І. Загальні положення</h2>

          <Grid columns="1fr 1fr" gap="2vw">
            <Cell>
              Однією із завдань освітньої політики держави є формування якісно
              нової системи освіти. Закономірною і обов’язковою умовою успішної
              реалізації цього завдання є забезпечення випереджального розвитку
              загальної середньої освіти, головною ознакою якої стає
              інноваційність. Інноваційність в освітній сфері є принципово
              важливою відповіддю на виклики сучасності. Інноваційний розвиток
              сучасного загальноосвітнього навчального закладу (далі – ЗНЗ) – це
              цілеспрямований процес, що забезпечує якісні зміни, перехід ЗНЗ до
              нового якісного стану. До пріоритетних напрямів розвитку закладу
              відносимо: підвищення якості навчальної діяльності учнів,
              інформатизація освітнього процесу в закладі, оновлення виховної
              системи, інноваційна діяльність, модернізація управлінської
              діяльності. Як один із шляхів побудови ефективної моделі
              інноваційного розвитку загальноосвітнього навчального закладу
              пропонується програма інноваційного розвитку загальноосвітніх
              навчальних закладів (далі – Програма).
            </Cell>

            <Cell>
              <Md>{`Нормативною базою для організації та виконання Програми є:

- Закони України: "Про освіту", "Про загальну середню освіту", "Про інноваційну діяльність", «Про пріоритетні напрями інноваційного розвитку держави», "Про основні засади розвитку інформаційного суспільства в Україні на 2007-2015 роки";
- Національна доктрина розвитку освіти, затверджена Указом Президента України від 17 квітня 2002 року №347/2002;
- Положення про здійснення інноваційної освітньої діяльності, , затверджене наказом МОН України від 07.11.2000 №1054;
- Положення про експериментальний загальноосвітній навчальний заклад , затверджене наказом МОН України від 23.11.2009 №1054.
`}</Md>
            </Cell>
          </Grid>
          <br />
          <Md>{`
Дана Програма ґрунтується на засадах філософії освіти, педагогічної та психологічної наук і спрямована на максимальне залучення всіх ресурсів для переходу ЗНЗ з режиму функціонування в режим керованих інноваційних змін, а саме: змін педагогічної системи ЗНЗ, її компонентів (освітнього, дидактичного, виховного, управлінського, матеріально-технічного тощо) та їх структурних елементів, які суттєво поліпшують результати діяльності ЗНЗ.

Реалізація Програми сприятиме створенню програм інноваційного розвитку загальної середньої освіти на міському, районному рівнях, на рівні окремого ЗНЗ, забезпеченню скоординованої діяльності міського та районних органів управління освітою, навчальних закладів, наукових установ, громадських організацій, допоможе консолідувати зусилля всіх продуктивних ресурсів, спрямувати їх на вирішення проблем підвищення ефективності використання інтелектуального потенціалу педагогів і конкурентоспроможності випускників, досягнення сталого розвитку ЗНЗ.
`}</Md>

          <Grid columns="1fr 1fr" gap="2vw">
            <Cell>
              <Md>{`
## ІI. Мета та основні завдання

Метою програми є забезпечення розвитку закладу освіти, якісних змін освітньої діяльності загальноосвітнього навчального закладу, які забезпечуватимуть зростання якості загальної середньої освіти, оптимізують процес навчання з урахуванням сучасних світових тенденцій та сприятимуть формуванню особистості учня, здатного до подальшої успішної життєвої самореалізації.

Цієї мети передбачається досягти шляхом вирішення таких основних завдань:

- забезпечення системного сучасного психолого-педагогічного та науково-методичного супроводження навчально-виховного процессу;
- підвищення якості освіти на інноваційній основі відповідно до сучасних вимог;
- організація цілеспрямованої діяльності всіх виховних структур міста зі створення умов для побудови цілісної безперервної системи виховання в освіті й поширення головних ідей сучасного виховання, заснованих на системі загальнокультурних і національних цінностей;
- створення додаткових умов для самовизначення, саморозвитку, самореалізації особистості, набуття соціально-громадського досвіду, сприяння професійній орієнтації.
- удосконалення муніципальної системи підвищення кваліфікації педагогічних та керівних кадрів ЗНЗ;
- оновлення в кожному навчальному закладі підходів для творчого, інтелектуального, духовного і фізичного розвитку учнів, обдарованих дітей та молоді;
- розробка науково-теоретичних засад та відповідних їм методичних рекомендацій щодо інноваційного розвитку закладу;
- створення сучасної матеріально-технічної бази для функціонування сучасної освіти;
- впровадження світових інноваційних педагогічних технологій, спрямованих на підвищення рівня інноваційного розвитку загальноосвітніх навчальних закладів;
- виявлення динаміки рівня інноваційного розвитку школи шляхом проведення констатуючого, поточного та підсумкового оцінювання.
`}</Md>
            </Cell>

            <Cell>
              <Md>{`
## ІІI. Очікувані результати

Виконання основних завдань і заходів програми забезпечить:

- створення у загальноосвітніх навчальних закладах інноваційних програм розвитку та концепції розвитку власної моделі інноваційного розвитку;
- забезпечення розвитку інформаційної взаємодії та інтеграції ЗНЗ у світовий освітній простір;
- оптимізація мережі закладів освіти до потреб міста;
- створення єдиної освітньої мережі Інтернет в місті, що надасть доступ загальноосвітнім навчальним закладам міста до світових інформаційних ресурсів та технологій;
- підвищення ефективності управлінської діяльності за рахунок вдосконалення системи інформаційного супроводу;
- здійснення експериментально-дослідницької діяльності системного характеру;
- створення умов для особистісного розвитку і творчої самореалізації учасників навчально-виховного процесу, укріплення їх здоров′я;
- застосування новітніх інформаційно-комунікаційних технологій у навчально-виховному процесі та управлінні школою;
- удосконалення та активізація інноваційної діяльності педагогічних кадрів;
- збагачення освіти інноваційними технологіями навчання та виховання, розширення зв'язків з міжнародними освітянськими організаціями;
- забезпечення дієвого соціального партнерства ЗНЗ з державними й громадськими організаціями та установами.
`}</Md>
            </Cell>
          </Grid>

          <div
            css={css`
              display: flex;
              flex-flow: column;
              align-items: center;
              img {
                width: 75%;
                display: block;
                margin: 0 auto;
              }
            `}
          >
            <Md>{`
## IV. Основні завдання та шляхи реалізації

![](/development-program/1.png)
![](/development-program/2.png)
![](/development-program/3.png)
![](/development-program/4.png)
![](/development-program/5.png)
![](/development-program/6.png)
![](/development-program/7.png)
![](/development-program/8.png)
![](/development-program/9.png)
![](/development-program/10.png)
![](/development-program/11.png)
`}</Md>
          </div>
        </Tab>

        <Tab title="Документи">
          <Md>{`
Положення

1. [Про внесення змін до Положення про порядок здійснення інноваційної освітньої діяльності](http://zakon5.rada.gov.ua/laws/show/z2111-12)
1. [Положення КЗШ 55 про порядок здійснення інноваційної освітньої діяльності](https://1drv.ms/w/s!AvfPBDS_9g9MnBIdTBPI91m2JHRu)

Заходи на виконання Програми

1. [Заходи КЗШ І-ІІІ ст. № 55, спрямовані на реалізацію міської програми розвитку освіти М. Кривого рогу на період 2016-2018 роки](https://1drv.ms/w/s!AvfPBDS_9g9Mjwoj5XnXG6XqR4dv)`}</Md>
        </Tab>
      </Tabs>
    </span>
  );
}
