import Table from "components/table";

export default function LocalAuthorities() {
  return <Table columns={columns} data={data} disablePagination />;
}

const columns = [
  {
    Header: "Представники від батьківської громадськості",
    id: "parent",
    accessor: (d) => d[0],
  },
  {
    Header: "Представники від учнівської громадськості",
    id: "pupil",
    accessor: (d) => (d[1].length ? `${d[1]} ДО "Первоцвіт"` : ""),
  },
  {
    Header: "Представники педагогічного колективу",
    id: "teacher",
    accessor: (d) => d[2],
  },
  {
    Header: "Клас",
    id: "class",
    accessor: (d) => d[3],
  },
];

const data = [
  ["Кулик Ірина Віталіївна", "", "Фербей В.М., класний керівник", "1-А"],
  [
    "Плотнікова Катерина Олексіївна",
    "",
    "Заярнюк С.А., класний керівник",
    "1-Б",
  ],
  ["Крянга Олена Юріївна", "", "Бубир Л.В., класний керівник", "1-В"],
  ["Чевська Анастасія Валеріївна", "", "Довмат Г.В., класний керівник", "2-А"],
  ["Коробка Наталя Олександрівна", "", "Лисенко О.Б., класний керівник", "2-Б"],
  ["Лещенко Галина Валеріївна", "", "Мугак Н.І., класний керівник", "3-А"],
  ["Клюєва Яна Русланівна", "", "Половинкина О.Б., класний керівник", "3-Б"],
  [
    "Тригуба Валентина Сергіївна",
    "",
    "Старікова Н.А., класний керівник",
    "4-А",
  ],
  ["Матіщук Марина Сергіївна", "", "Юшко А.А., класний керівник", "4-Б"],
  [
    "Нікіфорова Олена Олександрівна",
    "Ільїн Артем, голова загону",
    "Шевчук К.Ю., класний керівник",
    "5-А",
  ],
  [
    "Бондаренко Ірина Василівна",
    "Єременко Катерина, голова загону",
    "Таран Н.В., класний керівник",
    "5-Б",
  ],
  [
    "Луткова Олена Володимирівна",
    "Лутков Андрій, голова загону",
    "Балагуряк Є.Ю., класний керівник",
    "6-А",
  ],
  [
    "Дорошенко Вікторія Володимирівна",
    "Тимчук Марія, голова загону",
    "Капуста В.М., класний керівник",
    "6-Б",
  ],
  [
    "Нагасова Вікторія Валеріївна",
    "Мелькова Дарія, голова загону",
    "Харенко Ю.А., класний керівник",
    "6-В",
  ],
  [
    "Барило Світлана Анатоліївна",
    "Самойлова Катерина, голова загону",
    "Кузьменко Ю.Г., класний керівник",
    "7-А",
  ],
  [
    "Тонкова Євгенія Володимирівна",
    "Стрижньова Аріна, голова загону",
    "Печеневська Н.М., класний керівник",
    "7-Б",
  ],
  [
    "Лукащук Ганна Юріївна",
    "Гайман Лук'ян, голова загону",
    "Хоменко А.Ю., класний керівник",
    "8-А",
  ],
  [
    "Мандрига Маргарита Іванівна",
    "Прокопенко Єлизавета, голова загону",
    "Добровольська В.Е., класний керівник",
    "8-Б",
  ],
  [
    "Білик Ольга Олегівна",
    "Пасєка Марина, голова загону",
    "Артемюк Н.А., класний керівник",
    "9-А",
  ],
  [
    "Чеха Світлана Володимирівна",
    "Ненастіна Олександра, голова загону",
    "Стрембицька Л.А., класний керівник",
    "9-Б",
  ],
  [
    "Гладир Олена Петрівна",
    "Бурмістрова Ліза, голова загону",
    "Витрищенко С.М., класний керівник",
    "10-А",
  ],
  [
    "Руденко Ольга Миколаївна",
    "Тютюнник Єгор, голова загону",
    "Рзаєва Н.О., класний керівник",
    "11-А",
  ],
];
