import Table from "components/table";

export default function LocalAuthorities() {
  return <Table columns={columns} data={data} disablePagination />;
}

const columns = [
  {
    Header: "Представники від батьківської громадськості",
    id: "parent",
    accessor: (d) => d[0],
  },
  {
    Header: "Представники від учнівської громадськості",
    id: "pupil",
    accessor: (d) => d[1],
  },
  {
    Header: "Представники педагогічного колективу",
    id: "teacher",
    accessor: (d) => d[2],
  },
  {
    Header: "Клас",
    id: "class",
    accessor: (d) => d[3],
  },
];

const data = [
  ["Чебська Анастасія Валеріївна", "", "Довмат Г.В., класний керівник", "1-А"],
  ["Коробка Наталя Олександрівна", "", "Лисенко О.Б., класний керівник", "1-Б"],
  ["Лимаренко Вікторія Валеріївна ", "", "Мугак Н.І., класний керівник", "2-А"],
  ["Клюєва Яна Русланівна", "", "Половинкина О.А., класний керівник", "2-Б"],
  [
    "Тригуба Валентина Сергіївна",
    "",
    "Старікова С.А., класний керівник",
    "3-А",
  ],
  ["Володарська Наталя Сергіївна", "", "Юшко А.А., класний керівник", "3-Б"],
  ["Колесник Римма Володимирівна", "", "Фербей В.М., класний керівник", "4-А"],
  ["Бондаренко Ірина Василівна", "", "Заярнюк С.А., класний керівник", "4-Б"],
  [
    "Луткова Олена Володимирівна",
    "Сахно Клим, голова загону класу ДО «Первоцвіт»",
    "Балагуряк Є.Ю., класний керівник",
    "5-А",
  ],
  [
    "Задворна Олександра Олександрівна",
    "Константінова Яна, голова загону класу ДО «Первоцвіт»",
    "Капуста В.М., класний керівник",
    "5-Б",
  ],
  [
    "Нагасова Вікторія Валеріївна",
    "Мелькова Дар’я, голова загону класу ДО «Первоцвіт»",
    "Харенко Ю.А., класний керівник",
    "5-В",
  ],
  [
    "Барило Світлана Анатоліївна",
    "Самойлова Катерина, голова загону класу ДО «Первоцвіт»",
    "Кузьменко Ю.Г., класний керівник",
    "6-А",
  ],
  [
    "Гончарова Лідія Іванівна",
    "Марченко Яна, голова загону класу ДО «Первоцвіт»",
    "Драєнко О.І., класний керівник",
    "6-Б",
  ],
  [
    "Лукащук Ганна Юріївна",
    "Поїзд Софія, голова загону класу ДО «Первоцвіт»",
    "Хоменко А.Ю., класний керівник",
    "7-А",
  ],
  [
    "Мандрига Маргарита Іванівна",
    "Прокопенко Єлизавета, голова загону класу ДО «Первоцвіт»",
    "Добровольська В.Е., класний керівник",
    "7-Б",
  ],
  [
    "Сіренко Юлія Євгенівна",
    "Андріяш Євген, голова загону класу ДО «Первоцвіт»",
    "Артемюк Н.А., класний керівник",
    "8-А",
  ],
  [
    "Скубенік Надія Вікторівна",
    "Комарцова Анастасія, голова загону класу ДО «Первоцвіт»",
    "Люльченко О.Г., класний керівник",
    "8-Б",
  ],
  [
    "Гладир Олена Петрівна",
    "Горбатюк Владислав, голова загону класу ДО «Первоцвіт»",
    "Витрищенко С.М., класний керівник",
    "9-А",
  ],
  [
    "Мерва Ірина Вікторівна",
    "Головатий Максим, голова загону класу ДО «Первоцвіт»",
    "Чащина Н.В., класний керівник",
    "9-Б",
  ],
  [
    "Руденко Ольга Миколаївна",
    "Тютюник Євген, голова загону класу ДО «Первоцвіт»",
    "Рзаєва Н.О., класний керівник",
    "10-А",
  ],
  [
    "Подорожняк Олена Олегівна",
    "Шевченко Юлія, голова загону класу ДО «Первоцвіт»",
    "Печеневська Н.М., класний керівник",
    "11-А",
  ],
];
