import Md from "components/md";
import { Tab, Tabs } from "components/tabs";

export default function MeetingsAtDirector() {
  return (
    <Tabs vertical>
      <Tab title="Серпень 2020">
        <Md>{`
1. Про стан готовності школи до нового 2020/2021 навчального року.   
1. Про організацію роботи педагогічного колективу з охорони праці та техніки безпеки.                                                           
1. Про використання основних нормативних документів, що регламентують діяльність педагогічних працівників у 2019/2020 н.р.
1. Про планування виховної роботи на місяць.
1. Про режим роботи школи та правила внутрішнього трудового розпорядку у 2020/2021 н.р.                                                                                  
1. Про проходження обов’язкового медичного огляду працівниками школи.  
1. Готовність спортмайданчиків та спортивних залів, школи  до 2020/2021 навчального року.
1. Забезпечення виконання закону України «Про загальну середню освіту».
1. Основні напрямки роботи, які регламентує Концепція національно-патріотичного виховання дітей та молоді, затвердженої наказом МОН від 16.06.2015 № 641.  
1. Про особливості вивчення базових дисциплін у 2020/2021 н.р. 
1. Про рекомендації щодо організації харчування учнів на 2020/2021 н.р. 
1. Про проведення обліку пільгового контингенту та організацію пільгового харчування.
1. Про забезпечення школи підручниками та методичною літературою.  
1. Про особливості вивчення базових дисциплін у загальноосвітніх навчальних закладах у 2020/2021 н.р.. Виконання вимог інструктивно-методичних рекомендацій Міністерства освіти і науки України “Щодо вивчення у закладах загальної середньої освіти навчальних предметів у 2020/2021 навчальному році”(Лист МОН України від 03. 07. 2019 р. № 1/9-415  
`}</Md>
      </Tab>

      <Tab title="Вересень 2020">
        <Md>{`
1. Про впровадження заходів безпеки у навчальному закладі. Посилення пропускного режиму. Посилення та дотримання карантинних вимог.
1. Про організацію методичної роботи у 2020/2021 н.р
1. Про ознайомлення вчителів з листом УОН від 01.09.2018 № 1860 «Про благодійні внески». Про заборону втручання педагогічних працівників у діяльність благодійних фондів.
1. Про активізацію роботи по підготовці учнів до проведення учнівських олімпіад із базових дисціплин у 2020/2021 навчальному році.              
1. Про огляд підготовки шкільних предметних кабінетів та класних кімнат до навчального року.
1. Про роботу школи над обласною науково-методичною проблемою   «Педагогічні стратегії розвитку само ефективної особистості в освітньому просторі нової української школи».  (І етап).   
1. Ознайомлення вчителів з інструкціями по веденню класних журналів  (Наказ МОН від 08.04.2015 року № 412, Наказ МОН від 03.06.2008 р. № 496).                            
1. Залучення учнів до факультативних занять.      
1. Про вимоги до ведення шкільної документації.                            
1. Про результати медичного обстеження учнів
1. Активізація роботи шкільних методоб’єднань.
1. Про здійснення контролю за відвідуванням учнями школи, запобігання пропусків уроків, бродяжництва. Вимоги до ведення сигнального журналу.               
1. Про попередження дитячого травматизму, ТБ в школі. Активізація чергування вчителів.   
1. Про організацію роботи з дітьми, які потребують  особливої педагогічної уваги.   Робота ради профілактики. Робота наркопосту. 
1. Про залучення учнів до гурткової роботи.
1. Про хід Всеукраїнського рейду «Урок».   
1. Про працевлаштування випускників 9-го і 11-го класів.   
1. Про організацію роботи учнівського самоврядування.                   
1. Про проведення інвентаризації в школі.  
1. Про планування виховної роботи на жовтень.
`}</Md>
      </Tab>

      <Tab title="Жовтень 2020">
        <Md>{`
1. Про організацію атестації та курсової перепідготовки вчителів у 2020/2021 н.р. Типове положення про атестацію педагогічних працівників. Затвердження списків учителів на чергову атестацію 2021 року
1. Про вдосконалення заходів безпеки у навчальному закладі.
1. Про стан організація навчань і перевірки знань з цивільного захисту та охорони праці проведення інструктажів з питань охорони праці, безпеки життєдіяльності.
1. Про проведення вчителями школи інструктажів з учнями з ПДР, ТБ. Профілактика учнівського травматизму.
1. Функціонування системи підготовки учасників освітнього процесу до дій у надзвичайних ситуаціях, виконання заходів з безпеки життєдіяльності. Відпрацювання плану евакуації.
1. Про підготовку закладу  до роботи в зимовий період, систему теплопостачання до опалювального сезону. Про дотримання санітарно-гігієнічних норм життєдіяльності школи.   
1. Робота школи на І етапі науково-методичної проблеми «Педагогічні стратегії розвитку само ефективної особистості в освітньому просторі нової української школи».   
1. Про функціонування діючої комісії з превентивних питань.
1. Про суворе дотримання правил ТБ на уроках фізкультури, трудового навчання, фізики, хімії, біології, Захист Вітчизни, технічної та обслуговуючої праці.  
1. Організація харчування учнів. Стан охоплення учнів гарячим харчуванням у вересні.
1. Адаптація п’ятикласників  до навчання в основній школі.    
1. Про виконання працівниками закладу правил внутрішнього трудового розпорядку.                                                                                                         
1. Про планування виховної роботи на листопад.
`}</Md>
      </Tab>

      <Tab title="Листопад 2020">
        <Md>{`
1. Про посилення роботи працівників закладу по збереженню та економії тепла, електроенергії та дотримання санітарно-гігієнічних вимог в приміщенні школи.  
1. Про стан роботи з цивільного захисту. Активізація діяльності всіх підрозділів цивільного захисту школи. Про готовність сховищ школи до дій у надзвичайних ситуаціях та цивільного захисту населення.  
1. Про стан ведення журналів реєстрації інструктажів з питань охорони праці вчителями-предметниками. 
1. Про результати перевірки шкільної документації (журнали, зошити).
1. Результат перевірки роботи гуртків, факультативів, групи продовженого дня; роботи спортивних секцій і спецгруп.
1. Про підсумки проведення осінніх канікул.*    
1. Профорієнтаційна робота у 9,11 класах.  
1. Про проведення місячника військово-патріотичного виховання. 
1. Про посилення просвітницько – профілактичної роботи щодо запобігання випадків ДТП. Про стан роботи з попередження дитячого травматизму.               
1. Зайнятість учнів школи та  дітей «Групи ризику» під час осінніх канікул.   
1. Про стан роботи з дітьми пільгового контингенту.  Робота з проблемними сім’ями, відвідування навчальних занять учнями школи    
1. Звіт практичного психолога, соціального педагога,  педагога – організатора.  
1. Про роботу шкільної бібліотеки.                                                                        
1. Про роботу їдальні та харчування учнів.
1. Результати перевірки виконання санітарно-гігієнічного режиму у школі.
1. Про планування виховної роботи на грудень.
`}</Md>
      </Tab>

      <Tab title="Грудень 2020">
        <Md>{`
1. Про забезпечення режиму економії енергоресурсів (тепло, світло) і води. 
1. Про стан роботи по перевірці виконання навчальних планів і програм.
1. Про стан роботи попередження дитячого травматизму.  
1. Про планування роботи по оформленні школи до  Нового року.
1. Про посилення протипожежної безпеки в школі.
1. Про виконання плану роботи школи за І семестр.                                                  
1. Про відвідування учнями школи навчальних занять.                                        
1. Про науково-методичне забезпечення навчального процесу.                             
1. Про планування виховної роботи на січень
1. Про підготовку школи до зимових канікул.
`}</Md>
      </Tab>
      <Tab title="Грудень 2020 / Січень 2021">
        <Md>{`
1. Про підсумки навчалтно-виховного процесу за І семестр 2020–2021 н.р.
1. Про стан роботи школи з охорони праці, цивільного захисту у І семестрі 2020-2021 н.р.
1. Про проведення інструктажів з протипожежної безпеки.        
1. Про стан харчування учнів школи за І семестр. 
1. Про виконання плану роботи школи за І семестр.
1. Про терміни реєстрації учнів школи на пробну та основну  сесію ЗНО 2021 р.
1. Про підсумки  перевірки виконання навчальних планів і програм.
1. Про хід атестації працівників. Вивчення рівня фахової майстерності педагогів, що атестуються у 2021р. 
1. Про фінансово – економічну діяльність школи. 
1. Про стан роботи вихователів в ГПД за І семестр 2020/2021 н.р.    
1. Про економію енергоресурсів.                                                                                           
1. Стан спортивно-масової роботи в школі за Ісеместр 2020/2021 н.р.
1. Про підсумки проведення новорічних заходів та зимових канікул.
1. Про підсумки виконання начальних планів і програм у І семестрі 2020/2021 н.р.                                                                    
1. Про стан роботи психологічної служби школи за І семестр 2020/2021 н.р.                                                                 
1. Про підсумки перевірки ведення шкільної документації (класних журналів, зошитів).           
1. Про роботу психолого – соціальної служби в школі у І с. 2020/2021 н.р.  Про стан роботи з дітьми пільгового контингенту.  
1. Аналіз харчування учнів в закладі за І семестр
1. Про стан національно-патріотичного виховання учнів.
`}</Md>
      </Tab>

      <Tab title="Січень 2021">
        <Md>{`
1. Про планування виховної роботи на лютий.
`}</Md>
      </Tab>

      <Tab title="Лютий 2021">
        <Md>{`
1. Робота педагогічного колективу щодо запобігання правопорушень серед учнів.
1. Про стан викладання навчальних предметів у початкових класах
1. Про активізацію роботи по підготовці учнів до ЗНО 2021 року.
1. Основні вимоги до роботи класного керівника відповідно до Положення про класного керівника. Про стан роботи класного керівника по здійсненню контролю за відвідуванням учнями навчальних занять.
1. Про посилення роботи працівників закладу по збереженню та економії тепла, електроенергії та дотримання санітарно-гігієнічних вимог в приміщенні школи.  
1. Про заходи щодо вшанування річниці визволення м. Кривого Рогу  від німецько-фашистських загарбників.     
1. Про стан роботи шкільної бібліотеки.
1. Про стан профорієнтаційної роботи у школі.
1. Про необхідність дотримання працівниками школи інструкцій з техніки безпеки, охорони праці та пожежної безпеки на робочому місці.
1. Дотримання вимог техніки безпеки на спортивних майданчиках та спортивних спорудах під час проведення спортивних занять.
1. Про планування виховної роботи на березень.
`}</Md>
      </Tab>

      <Tab title="Березень 2021">
        <Md>{`
1. Про стан викладання історії та правознавства.
1. Стан харчування учнів у січні-березні.
1. Про посилення роботи педагогічних працівників щодо  підготовки учнів  до ДПА.
1. Про роботу загону юних інспекторів руху та  дружини юних пожежників.                                                                                     
1. Про виконання працівниками закладу правил  внутрішнього  трудового розпорядку.                                                                                                         
1. Положення про ДПА (наказ МОН України від 30.12.2014 № 1574)* – як основний документ, що регламентує проведення ДПА у 2020– 2021 н.р.
1. Про порядок закінчення навчального року та проведення державної підсумкової атестації учнів 4,9,11 класів у        2020/2021 н.р.  Вибір предмету для ДПА учнів 9-х класів.  
1. Вивчення питання звільнення від ДПА та здачі ДПА екстерном.  
1. Про наслідки атестації педагогічних працівників та курсової перепідготовки у 2020/2021 н.р.
1. Про стан проведення додаткових спеціальних об’єктових тренувань з питань цивільного захисту з урахуванням завдань, визначених на особливий період. Про підготовку до Дня цивільного захисту.
1. Про стан умов та безпеки праці та відповідність критеріям, встановленими законодавчими та нормативно-правовими актами з охорони праці, безпеки життєдіяльності.  
1. Про підсумки підготовки адміністративно-педагогічного персоналу і учнів школи з цивільного захисту за 2020 рік та постановка завдань на 2021 рік.          
1. Про стан роботи педколективу з попередження правопорушень, про відвідування учнями школи
1. Стан роботи з дітьми облікових категорій.
1. Про стан ведення шкільної документації (класних журналів).
1. Про стан роботи в мікрорайоні школи.                     
1. Про стан протипожежної роботи у закладі. Ведення нормативних документів. Стан проведення заходів з пожежної безпеки.
1. Про вдосконалення заходів безпеки у навчальному закладі.  Стан підготовки захисних споруд та сховищ закладу.
1. Про планування виховної роботи на квітень.
`}</Md>
      </Tab>

      <Tab title="Квітень 2021">
        <Md>{`
1. Про хід підготовки до проведення ДПА.
1. Про підсумки атестації та курсової перепідготовки педагогічних кадрів у 2020/2021  н.р. 
1. Про стан роботи з дітьми пільгового контингенту.
1. Про забезпечення умов щодо збереження  здоров'я учнів.
1. Про підготовку до проведення  робіт по благоустрою закладу.                                  
1. Про підготовку та проведення дня ЦЗ.
1. Охорона праці в школі.
1. Про виконання Закону України «Про мови»                                                 
1. Про підсумки проведення весняних канікул.
1. Про стан попередження дитячого травматизму.
1. Про здійснення військово-патріотичного виховання в школі.
1. Про проведення місячника щодо дотримання законодавства про загальну середню освіту.
1. Про стан роботи психологічної служби.
1. Про забезпечення режиму економії енергоресурсів.
1. Про роботу шкільної бібліотеки.
1. Про економічне виховання учнів.
1. Про стан ведення охорони праці в школі.
1. Про стан ведення шкільної документації (учнівських зошитів).         
1. Про хід проведення комплектації педагогічних кадрів на 2021 – 2022 н.р.  Переведення працівників, що досягли пенсійного віку та отримують виплати, на контрактну форму роботи.
1. Про планування виховної роботи на травень
`}</Md>
      </Tab>

      <Tab title="Травень 2021">
        <Md>{`
1. Організація закінчення 2020/2021 н.р., ознайомлення з інструктивно-інформативною документацією про закінчення навчального року.  
1. Виконання Закону України «Про освіту», «Про загальну середню освіту», про підсумки проведення місячника «Про дотримання законодавства про загальну середню освіту».                                                                     
1. Про підсумки перевірки виконання навчальних планів і програм.    
1. Підготовка до відкриття дитячого закладу відпочинку – табір з денним перебуванням.                                                                              
1. Літнє оздоровлення учнів пільгових категорій.
1. Дотримання ТБ під час навчальних занять та в побуті. Робота з попередження дитячого травматизму під час перебування у дитячому таборі відпочинку.
1. Звіт про роботу ради профілактики за рік.                              
1. Інструкція з обліку дітей-підлітків шкільного віку.
1. Обговорення та затвердження екзаменаційних матеріалів.
1. Зайнятість учнів школи та учнів облікової категорії в літній канікулярний період.
1. Про підсумки роботи школи на І етапі роботи над науково-методичною проблемою.  
 `}</Md>
      </Tab>

      <Tab title="Червень 2021">
        <Md>{`
1. Про підготовку до серпневої конференції та підсумкової педагогічної ради школи.
1. Про підсумки методичної роботи.
1. Про підсумки роботи у 10-11 профільних класах.
1. Про підсумки освітньої роботи за 2020/2021 н.р.            
1. Про підсумки гурткової роботи в школі.
1. Про підсумки перевірки класних журналів.
1. Про підсумки виховної роботи.
1. Звіт практичного психолога, соціального педагога,  педагога – організатора.  
1. Про підсумки  роботи з молодими та малодосвідченими вчителями..
1. Про підсумки роботи групи продовженого дня.
`}</Md>
      </Tab>
    </Tabs>
  );
}
