import Md from "components/md";
import { Tab, Tabs } from "components/tabs";

export default function MethodologicalOrganizationalMeetings() {
  return (
    <Tabs vertical>
      <Tab title="Вересень 2019">
        <Md>{`
1. Про особливості вивчення базових дисциплін у 2019/2020 н.р. 
1. Опрацювання наказа МОН від 05.08.2018 № 948 «Про затвердження змін до навчальних програм для 1-4 класів загальноосвітніх навчальних закладів»   
1. Листа Міністерства освіти і науки України № 1/9-436 від 09 липня 2019 року «Щодо методичних рекомендацій про викладання навчальних предметів у загальноосвітніх навчальних закладах у 2019/2020 навчальному році»
1. Залучення учнів до факультативних занять.      
1. Про вимоги до ведення шкільної документації.
1. Про залучення учнів до гурткової роботи.
1. Про організацію роботи учнівського самоврядування.
`}</Md>
      </Tab>

      <Tab title="Жовтень 2019">
        <Md>{`
1. Про хід проведення предметних олімпіад.
1. Про підсумки моніторингових контрольних робіт  учнів 2-11 класів.  
1. Про відвідування учнями школи, навчальних занять. Ведення сигнального журналу.  
1. Про стан роботи вчителів у мікрорайоні школи.
1. Про роботу з дітьми, які потребують особливої педагогічної уваги
1. Про проведення предметних тижнів/декад  педагогічної майстерності по впровадженню новітніх методів та прийомів навчання – складової соціалізації учнів. 
`}</Md>
      </Tab>

      <Tab title="Листопад 2019">
        <Md>{`
1. Вимоги до розробок уроків учителів під час проведення предметних тижнів. Створення моделі сучасного уроку   
1. Про хід проведення районного туру учнівських олімпіад.         
1. Про активізацію роботи по підготовці учнів до ЗНО 2020 р.
1. Про стан ведення щоденників учнями, перевірки їх класоводами й класними керівниками.
1. Результати контролю за веденням вчителями  поурочних планів.
1. Про зайнятість учнів у гуртках. Якість підготовки керівників і рівень проведення занять.
`}</Md>
      </Tab>

      <Tab title="Грудень 2019">
        <Md>{`
1. Про відвідування учнями школи навчальних занять. Стан ведення сигнального журналу.  
1. Про планування роботи учнів і працівників школи на канікулах.  
`}</Md>
      </Tab>

      <Tab title="Січень 2020">
        <Md>{`
1. Про стан роботи з дітьми, які потребують особливої педагогічної уваги.
1. Про стан роботи вихователів в ГПД за І семестр 2019/2020 н.р.    
1. Про стан ведення електронних журналів учителями школи.
1. Про підсумки виступу учнів у другому етапі Всеукраїнських олімпіад з базових дисциплін. 
1. Про стан гурткової роботи в школі за І семестр 2019/2020 н.р.
`}</Md>
      </Tab>

      <Tab title="Лютий 2020">
        <Md>{`
1. Стан ведення щоденників учнями 8-11 класів.
1. Дотримання об’єктивності при виставленні учням оцінок.  
1. Про стан оснащення навчальних кабінетів  ди¬дактичним матеріалом та технічними засобами навчання.
1. Про підготовку до участі у обласному ярмарку-виставці педагогічних ідей.
1. Про функціонування інформативного простору закладу. Ведення електронних журналів та щоденників.
`}</Md>
      </Tab>

      <Tab title="Березень 2020">
        <Md>{`
1. Про стан гурткової роботи
1. Про хід роботи зі здібними та обдарованими учнями.      
1. Стан профорієнтаційної роботи в 9-х та 11-х класах.
1. Про стан набору учнів у 1, 10 класи на 2019/2020 н.р.  
1. Про підсумки відзначення 204-річчя з Дня народження Т.Г. Шевченка. Організація, проведення та участь у всіх заходах, конкурсах, присвячених великому Кобзарю.
`}</Md>
      </Tab>

      <Tab title="Квітень 2020">
        <Md>{`
1. Про навчально-методичне забезпечення профільного навчання.
1. Про результати роботи загону юних інспекторів руху та дружини юних пожежників.
1. Про залучення учнів до шкільного табору відпочинку.  
`}</Md>
      </Tab>

      <Tab title="Травень 2020">
        <Md>{`
1. Про підсумки роботи школи над науково-методичною проблемою.  
1. Про підсумки роботи з обдарованими.
1. Про підсумки роботи з молодими вчителями.
1. Звіт про роботу методичних об’єднань.
1. Звіт про роботу творчих груп.
`}</Md>
      </Tab>
    </Tabs>
  );
}
