import Md from "components/md";
import { Tab, Tabs } from "components/tabs";

export default function ParentCommittee() {
  return (
    <Tabs vertical>
      <Tab title="Вересень 2019">
        <Md>{`
- Підсумки освітнього процесу закладу за 2018-2019 н.р..
- Напрямки та результативність виховної роботи, спортивні досягнення учнів за 2018-2019 н.р..
- Про підсумки роботи соціально-психологічної служби за 2018-2019 н.р..
- Особливості освітнього процесу у 2019– 2020 н.р.,  режим роботи школи.
- Про рекомендації УОН щодо організації харчування учнів у 2019– 2020 н.р.. Порядок надання безкоштовного харчування дітям пільгових категорій.
- Стан забезпечення підручниками на 2019-2020 н.р..
- Про дотримання правил техніки безпеки у школі та поза школою.
- Про посилення пропускного режиму та вдосконалення заходів безпеки у навчальному закладі.
- Орієнтовний перелік потреб навчального закладу станом на 01.09.2018 р. та стан виконання запланованих робіт по благоустрою навчального закладу на 01.09.2019 р.
- Про надходження матеріальних цінностей з міського та районного бюджетів, спецфонду.
- Звіт про фінансово – господарську діяльність за 2018– 2019 н.р.. Інформування голови батьківського комітету Подорожняк О.О. про фінансово-господарську діяльність батьківського комітету за 2018-2019 н.р.
- Вибори органу батьківського самоврядування. Легалізація батьківського комітету- органу батьківського самоврядування.
`}</Md>
      </Tab>

      <Tab title="Жовтень 2019">
        <Md>{`
- Збереження життя та здоров’я  учнів школи під час навчання та у позаурочний час на осінніх канікулах.
- Запобігання бездоглядності і безпритульності дітей у вільний від занять час. 
- Залучення учнів до шкільних спортивних секцій та позашкільних навчальних закладів.
- Зміцнення зв’язків між родиною, навчальним закладом і громадськістю з метою встановлення єдності їх виховного впливу на дітей.
- Приведення у відповідність до діючих норм укріплень та укриттів школи.
- Планування заходів щодо покращення матеріально-технічної бази навчального закладу та його благоустрою. 
`}</Md>
      </Tab>

      <Tab title="Грудень 2019">
        <Md>{`
- Про результати закінчення І семестру 2019 – 2020 н.р.
- Про стан роботи з охорони життя та здоров’я учнів, запобігання дитячому травматизму, дотримання правил техніки безпеки в школі, на дорозі, вдома під час канікул.
- Аналіз відвідування учнями школи. Зв'язок із сім’єю. Результативність проведення рейдів у сім’ї. 
- Про стан харчування учнів школи.  
- Про зайнятість учнів у позакласній та гуртковій роботі.
- Звіт про хід виконання заходів щодо покращення матеріально-технічної бази навчального закладу та його благоустрою.
`}</Md>
      </Tab>

      <Tab title="Березень 2020">
        <Md>{`
- Про посилення пропускного режиму та вдосконалення заходів безпеки у навчальному закладі.
- Успішність учнів, відвідування школи, зовнішній вигляд.
- Про залучення учнів 1-8,10 класів до пришкільного табору «Веселка»
- Про дотримання правил техніки безпеки у школі та у позаурочний час.
- Про стан підготовки шкільних сховищ та укриттів.
`}</Md>
      </Tab>

      <Tab title="Травень 2020">
        <Md>{`
- Звіт директора школи про роботу у 2019– 2020 н.р. 
- Про підсумки участі учнів школи в інтелектуальних конкурсах та заходах різних рівнів.
- Про результативність роботи педагогів над власною самоосвітою.
- Про підсумки освітньої роботи за 2019 – 2020 н.р.
- Про роботу пришкільного табору «Веселка».
- Про підсумки виховної роботи школи.
- Про підсумки фізкультурно-оздоровчої роботи.
- Про підсумки роботи з дітьми пільгових категорій, літнє оздоровлення.
- Про дотримання правил техніки безпеки у школі та у позаурочний час.
- Звіт членів шкільного батьківського комітету про проведену роботу по благоустрою закладу та завдання на канікулярний період.  
`}</Md>
      </Tab>
    </Tabs>
  );
}
