import Md from "components/md";
import { Tab, Tabs } from "components/tabs";

export default function ParentCommittee() {
  return (
    <Tabs vertical>
      <Tab title="Вересень 2020">
        <Md>{`
1. Орієнтовна тематика засідань органу батьківського самоврядування
1. Підсумки освітнього процесу закладу за 2019-2020 н.р..
1. Напрямки та результативність виховної роботи, спортивні досягнення учнів за 2019-2020 н.р..
1. Про підсумки роботи соціально-психологічної служби за 2019-2020 н.р..
1. Особливості освітнього процесу у 2019– 2020 н.р.,  режим роботи школи.
1. Про рекомендації департаменту ОН щодо організації харчування учнів у 2019– 2020 н.р.. Порядок надання безкоштовного харчування дітям пільгових категорій.
1. Стан забезпечення підручниками на 2020-2021 н.р..
1. Про дотримання правил техніки безпеки у школі та поза школою.
1. Про посилення пропускного режиму та вдосконалення заходів безпеки у навчальному закладі.
1. Орієнтовний перелік потреб навчального закладу станом на 01.09.2020 р. та стан виконання запланованих робіт по благоустрою навчального закладу на 01.09.2020 р.
1. Про  надходження матеріальних цінностей з міського та районного бюджетів, спецфонду.
1. Звіт про фінансово – господарську діяльність за 2019– 2020 н.р.. Інформування голови батьківського комітету Подорожняк О.О. про фінансово-господарську діяльність батьківського комітету за 2019-2020 н.р.
1. Вибори органу батьківського самоврядування. Легалізація батьківського комітету- органу батьківського самоврядування.
`}</Md>
      </Tab>

      <Tab title="Жовтень 2020">
        <Md>{`
1. Збереження життя та здоров’я  учнів школи під час навчання та у позаурочний час на осінніх канікулах.
1. Запобігання бездоглядності і безпритульності дітей у вільний від занять час. 
1. Залучення учнів до шкільних спортивних секцій та позашкільних навчальних закладів.
1. Зміцнення зв’язків між родиною, навчальним закладом і громадськістю з метою встановлення єдності їх виховного впливу на дітей.
1. Приведення у відповідність до діючих норм укріплень та укриттів школи.
1. Планування заходів щодо покращення матеріально-технічної бази навчального закладу та його благоустрою. 
`}</Md>
      </Tab>

      <Tab title="Грудень 2020">
        <Md>{`
1. Про результати закінчення І семестру 2020 – 2021 н.р.
1. Про стан роботи з охорони життя та здоров’я учнів, запобігання дитячому травматизму, дотримання правил техніки безпеки в школі, на дорозі, вдома під час канікул.
1. Аналіз відвідування учнями школи. Зв'язок із сім’єю. Результативність проведення рейдів у сім’ї. 
1. Про стан харчування учнів школи.  
1. Про зайнятість учнів у позакласній та гуртковій роботі.
1. Звіт про хід виконання заходів щодо покращення матеріально-технічної бази навчального закладу та його благоустрою.
`}</Md>
      </Tab>

      <Tab title="Березень 2021">
        <Md>{`
1. Про посилення пропускного режиму та вдосконалення заходів безпеки у навчальному закладі.
1. Успішність учнів, відвідування школи, зовнішній вигляд.
1. Про залучення учнів 1-8,10 класів до пришкільного табору «Веселка»
1. Про дотримання правил техніки безпеки у школі та у позаурочний час.
1. Про стан підготовки шкільних сховищ та укриттів.
`}</Md>
      </Tab>

      <Tab title="Травень 2021">
        <Md>{`
1. Звіт директора школи про роботу у 2019– 2020 н.р. 
1. Про підсумки участі учнів школи в інтелектуальних конкурсах та заходах різних рівнів.
1. Про результативність роботи педагогів над власною самоосвітою.
1. Про підсумки освітньої роботи за 2020 – 2021 н.р.
1. Про роботу пришкільного табору «Веселка».
1. Про підсумки виховної роботи школи.
1. Про підсумки фізкультурно-оздоровчої роботи.
1. Про підсумки роботи з дітьми пільгових категорій, літнє оздоровлення.
1. Про дотримання правил техніки безпеки у школі та у позаурочний час.
1. Звіт членів шкільного батьківського комітету про проведену роботу по благоустрою закладу та завдання на канікулярний період.  
`}</Md>
      </Tab>
    </Tabs>
  );
}
