import Md from "components/md";
import { Tab, Tabs } from "components/tabs";

export default function PedagogicalCouncil() {
  return (
    <Tabs vertical>
      <Tab title="29 серпня 2019">
        <Md>{`
1. Про підсумки діяльності педагогічного колективу школи у 2018-2019 н.р. та пріоритетні завдання щодо підвищення якості освітнього процесу у 2019-2020 н. р.
1. Затвердження освітньої програми Криворізької загальноосвітньої школи І-ІІІ ступенів № 55.
1. Про розподіл варіативної частини навчального плану; про вимоги до складання розкладу уроків, розкладу занять факультативів, гурткової роботи.
1. Організований початок навчального року:
     - погодження річного плану роботи школи на 2019 – 2020 навчальний рік;
     - затвердження режиму роботи школи; 
     - вивчення рекомендацій департамент освіти і науки виконкому Криворізької міської ради щодо організації харчування учнів у 2019-2020 н.р 
     - затвердження правил внутрішнього трудового розпорядку;
     - охорона праці в школі;
     - затвердження плану роботи шкільної бібліотеки;
     - затвердження плану роботи методичної ради;
     - затвердження плану роботи соціально-психологічної служби.
1. Про комплексні заходи з безпеки життєдіяльності та ОП на 2019-2020 н.р.
1. Про План заходів КЗШ № 55 на 2019-2020 н.р. щодо профілактики правопорушень серед дітей.
1. Звіт про роботу психологічної служби.
1. Вивчення законодавчих документів щодо розвитку освіти України.
`}</Md>
      </Tab>

      <Tab title="Листопад 2019">
        <Md>{`
1. Про підсумки проведення основних заходів  реалізації Концепції національно-патріотичного виховання у 2018-2019 н.р. як важливої складової організації виховної та координаційно-методичної роботи.
1. Результативність системи планування виховної роботи у школі та діяльності класних керівників 1-11 класів за підсумками участі класних колективів в загальношкільних, виховних заходах. 
1. Учнівське самоврядування як ключовий  ресурс розвитку гармонійної особистості школяра.
1. Соціалізація учнів як результат створення гуманістичного освітнього середовища навчального закладу. 
1. Про затвердження Плану  основних заходів КЗШ № 55  з питань профілактики дитячого дорожньо-транспортного травматизму на 2019/2020 н.р.
1. Про виконання рішень попередньої педради.
`}</Md>
      </Tab>

      <Tab title="Січень 2020">
        <Md>{`
1. Ефективність добору сучасних освітніх методик та інноваційних підходів до викладання біології
1. Про хід атестації педагогічних працівників у 2020 році. 
1. Про підсумки освітнього процесу за І семестр 2019/2020 н.р. 
1. Про стан відвідування учнями школи за І семестр 2019/2020 н.р. 
1. Про виконання рішень попередньої педради.
`}</Md>
      </Tab>

      <Tab title="Березень 2020">
        <Md>{`
1. Творчий підхід в організації навчальної діяльності на уроках трудового навчання та технологій як напрямок соціалізації особистості.     
1. Положення про ДПА  (наказ МОН України від 30.12.2014 № 1574*). наказ МОН від 07 грудня 2018 р. "Про затвердження Порядку проведення державної підсумкової атестації" (зареєстровано в міністерстві юстиції України 02 січня 2019 р. № 8/32979).
1. Про порядок закінчення навчального року та проведення державної підсумкової атестації учнів 4,9,11 класів у 2019-2020 н.р. * Вибір предмету для ДПА учнів 9-х класів*.	     
1. Затвердження проекту робочого навчального плану на 2020 – 2021 н.р. 
1. Про результати атестації та курсової перепідготовки педагогічних працівників у 2019/2020 н.р. 
1. Аналіз роботи з охорони праці, запобігання нещасних випадків серед  учасників освітнього процесу. Про посилення заходів щодо попередження дитячого травматизму, профілактика правопорушень, злочинності, дитячої бездоглядності.
1. Виконання рішень попередньої педради. 
`}</Md>
      </Tab>

      <Tab title="Квітень 2020">
        <Md>{`
1. Вибір предметів для проходження ДПА учнями 11-х класів.
1. Розгляд та погодження матеріалів проведення ДПА учнів 4,9,11 класів.
1. Про звільнення учнів від проходження ДПА за курс базової/повної загальної середньої освіти.
1. Про претендентів, учнів 10 класу, на нагородження Золотою медаллю «За високі досягнення у навчанні» у 2021 році.
1. Про виконання рішень попередньої педради.
`}</Md>
      </Tab>

      <Tab title="Травень 2020">
        <Md>{`
1. Добір продуктивних методів та прийомів навчання під час вивчення навчальних дисциплін у початкових класах як запорука ефективності освітнього процесу.
1. Про переведення учнів 1-8,10 класів до наступного класу. 
1. Про виконання рішень попередньої педради. 
`}</Md>
      </Tab>

      <Tab title="Червень 2020">
        <Md>{`
1. Про випуск учнів 9-х класів та видачу атестатів.
1. Про нагородження учнів за особливі досягнення у навчанні.
`}</Md>
      </Tab>

      <Tab title="Червень 2020">
        <Md>{`
1. Про випуск учнів 11-х класів зі школи. Про представлення до нагородження учнів 11-х класів золотою медаллю «За високі досягнення у навчанні» та срібною медаллю «За досягнення у навчанні».
1. Про представлення до нагородження випускників 11-х класів Похвальними грамотами за особливі досягнення у вивченні окремих предметів.
1. Виконання рішень попередньої педради.
`}</Md>
      </Tab>
    </Tabs>
  );
}
