import Md from "components/md";
import { Tab, Tabs } from "components/tabs";

export default function PedagogicalCouncil() {
  return (
    <Tabs vertical>
      <Tab title="27 серпня 2020">
        <Md>{`
1. Про підсумки діяльності педагогічного колективу школи у 2019-2020 н.р. та пріоритетні завдання щодо підвищення якості освітнього процесу у 2020-2021 н.р.
1. Про особливості освітнього процесу в 2020-2021 н.р.  Про вивчення рекомендацій, затверджених листом МОН  від 05.08.2020 № 1/9-420 «Щодо організації роботи закладів загальної середньої освіти у 2020/2021 навчальному році».                                                                    
1. Затвердження освітньої програми Криворізької загальноосвітньої школи І-ІІІ ступенів    № 55                                                                                                               
1. Про розподіл варіативної частини навчального плану; про вимоги до складання розкладу уроків, розкладу занять факультативів, гурткової роботи.           
1. Організований початок навчального року:
    - погодження річного плану роботи школи на 2020 – 2021 навчальний рік;
    - затвердження режиму роботи школи;
    - вивчення рекомендацій департаменту освіти і науки виконкому Криворізької міської ради щодо організації харчування учнів у 2020-2021 н.р (ХАССП);                 
    - затвердження правил внутрішнього трудового розпорядку;
    - охорона праці в школі;
    - затвердження плану роботи шкільної бібліотеки;
    - затвердження плану роботи методичної ради;
    - затвердження плану роботи соціально-психологічної служби.

1. Про комплексні заходи з безпеки життєдіяльності та ОП на 2020-2021 н.р.
1. Про тимчасові зміни режиму роботи закладу під час пандемії у 2020/2021 н.р.
1. Про План заходів КЗШ № 55 на 2020-2021 н.р. щодо профілактики правопорушень серед дітей.                         (Алтинбаєва Л.М.)
1. Звіт про роботу психологічної служби.
1. Вивчення законодавчих документів щодо розвитку освіти України.
`}</Md>
      </Tab>

      <Tab title="Жовтень 2020">
        <Md>{`
1. Аналіз виховної роботи за минулий 2019-2020 н.р. Партнерство родини та школи у формуванні творчого потенціалу та розвитку здібностей дитини в сучасному освітньому просторі. Творчий потенціал класного керівника – важливий чинник розвитку самоефективної особистості в освітньому просторі нової української школи.                                            
1. Результативність системи планування виховної роботи у школі та діяльності класних керівників 1-11 класів за підсумками участі класних колективів в загальношкільних, виховних заходах за 2019-2020 н.р.                   
1. Учнівське самоврядування як один з ключових ресурсів розвитку самоефективної особистості  школяра в освітньому просторі нової української школи.         
1. Про затвердження Плану  основних заходів КЗШ №55 КМР ДО з питань профілактики дитячого дорожньо-транспортного травматизму на 2020-2021 навчальний рік.    
1. Про виконання рішень попередньої педагогічної ради.
`}</Md>
      </Tab>

      <Tab title="Січень 2021">
        <Md>{`
1. Педагогічні стратегії розвитку самоефективної особистості засобами використання сучасних освітніх методик під час викладання географії.
1. Про хід атестації педагогічних працівників у 2021 році. 
1. Про підсумки освітнього процесу за І семестр 2020/2021 н.р. 
1. Про стан відвідування учнями школи за І семестр 2020/2021 н.р. 
1. Про виконання рішень попередньої педради. 
`}</Md>
      </Tab>

      <Tab title="Березень 2021">
        <Md>{`
1. Творчий підхід до стратегії розвитку само ефективної особистості під час організації навчальної діяльності на уроках російської мови та зарубіжної літератури.
1. Положення про ДПА  (наказ МОН України від 30.12.2014 № 1574*). наказ МОН від 07 грудня 2018 р. "Про затвердження Порядку проведення державної підсумкової атестації" (зареєстровано в міністерстві юстиції України 02 січня 2019 р. № 8/32979).
1. Про порядок закінчення навчального року та проведення державної підсумкової атестації учнів 4,9,11 класів у 2020-2021 н.р. * Вибір предмету для ДПА учнів 9-х класів*.       
1. Затвердження проекту освітньої програми на 2021 – 2022 н.р. 
1. Про результати атестації та курсової перепідготовки педагогічних працівників у 2020/2021 н.р. 
1. Аналіз роботи з охорони праці, запобігання нещасних випадків серед  учасників освітнього процесу. Про посилення заходів щодо попередження дитячого травматизму, профілактика правопорушень, злочинності, дитячої бездоглядності.
1. Виконання рішень попередньої педради.
`}</Md>
      </Tab>

      <Tab title="Квітень 2021">
        <Md>{`
1. Вибір предметів для проходження ДПА у формі ЗНО учнями 11-х класів.
1. Розгляд та погодження матеріалів проведення ДПА учнів 4,9 класів. 
1. Про звільнення учнів від проходження ДПА за курс базової/повної загальної середньої освіти.   
1. Про претендентів, учнів 10 класу, на нагородження Золотою медаллю «За високі досягнення у навчанні» у 2022 році.        
1. Про виконання рішень попередньої педради. 
`}</Md>
      </Tab>

      <Tab title="Травень 2021">
        <Md>{`
1. Добір продуктивних методів та прийомів навчання як передумови само ефективної особистості під час викладання фізичної культури та захисту Вітчизни.
1. Про переведення учнів 1-8,10 класів до наступного класу. 
1. Про виконання рішень попередньої педради.
`}</Md>
      </Tab>

      <Tab title="Червень 2021">
        <Md>{`
1. Про випуск учнів 9-х класів та видачу документів про базову загальну середню освіту.
1. Про нагородження учнів за особливі досягнення у навчанні.
`}</Md>
      </Tab>

      <Tab title="Червень 2021">
        <Md>{`
1. Про випуск учнів 11-х класів зі школи. Про представлення до нагородження учнів 11-х класів золотою медаллю «За високі досягнення у навчанні»* та срібною медаллю «За досягнення у навчанні».*
1. Про представлення до нагородження випускників 11-х класів Похвальними грамотами за особливі досягнення у вивченні окремих предметів.*
1. Виконання рішень попередньої педради.
`}</Md>
      </Tab>
    </Tabs>
  );
}
